In [2]:
import pandas

In [4]:
print(pandas.__version__)

0.25.3

In [6]:
csv_file = pandas.read_csv('./data/feature_engineering.csv')

In [8]:
type(csv_file)

pandas.core.frame.DataFrame

In [11]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'
type(csv_file)

pandas.core.frame.DataFrame

In [13]:
csv_file

    UserId
0        1
1        2
2        3
3        4
4        5
..     ...
77      78
78      79
79      80
80      81
81      82

[82 rows x 1 columns]

In [16]:
product_df = pandas.read_csv('data/product_data.csv')
product_df

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp

In [18]:
product_df['ShippingLocation']

0     Delhi
1     Delhi
2      Pune
3    Mumbai
Name: ShippingLocation, dtype: object

In [19]:
product_df[['ProductName','Cost']]

  ProductName   Cost
0       LEDTV  32990
1     Printer   5990
2    Split AC  32050
3   Microwave  12670

In [21]:
listOfCols  = ['ProductName','Cost']
product_df[listOfCols]

  ProductName   Cost
0       LEDTV  32990
1     Printer   5990
2    Split AC  32050
3   Microwave  12670

In [23]:
index = 2
product_df.loc[index]

ProductID                  3
ProductName         Split AC
Cost                   32050
ShippingLocation        Pune
SellerName           XY Corp
Name: 2, dtype: object

In [25]:
index = 2
product_df.loc[:index]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp

In [28]:
row = 2
product_df.iloc[:row]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt

In [31]:
row = 2
product_df.iloc[-row:]

   ProductID ProductName   Cost ShippingLocation SellerName
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp

In [33]:
product_df.iloc[:,1:4]

  ProductName   Cost ShippingLocation
0       LEDTV  32990            Delhi
1     Printer   5990            Delhi
2    Split AC  32050             Pune
3   Microwave  12670           Mumbai

In [35]:
product_df[product_df['Cost']>=30000]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp

In [36]:
product_df[(product_df['Cost']>=30000) & (product_df['ShippingLocation']=='Delhi') ]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt

In [39]:
product_df[~(product_df['Cost']>=30000)]

   ProductID ProductName   Cost ShippingLocation SellerName
1          2     Printer   5990            Delhi    ABC Pvt
3          4   Microwave  12670           Mumbai    PQ Corp

In [43]:
product_df = product_df.rename(columns = {'Cost':'price','shippingLocation':'destination'})
product_df

   ProductID ProductName  price ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp

In [45]:
product_df['NumberOfProduct'] = 1

In [47]:
product_df.isnull()

,ProductID,ProductName,price,ShippingLocation,SellerName,NumberOfProduct
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False

In [49]:
product_df['price'].isnull()

0    False
1    False
2    False
3    False
Name: price, dtype: bool

In [51]:
#Drop all rows having any null value
product_df.dropna(axis=0)

#Drop all columns having any null value
product_df.dropna(axis=1)

#Drop all rows having less than k null values
product_df.dropna(axis=0,thresh=5)

#Drop all columns having all null values
product_df.dropna(axis=0,how='all')

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
1          2     Printer   5990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1

In [53]:
product_df.fillna(0)

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
1          2     Printer   5990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1

In [55]:
product_df.groupby('SellerName')

In [58]:
regiment_preScore = product_df.groupby(['SellerName','ShippingLocation'])
regiment_preScore

In [60]:
product_df.describe()

       ProductID         price  NumberOfProduct
count   4.000000      4.000000              4.0
mean    2.500000  20925.000000              1.0
std     1.290994  13669.053857              0.0
min     1.000000   5990.000000              1.0
25%     1.750000  11000.000000              1.0
50%     2.500000  22360.000000              1.0
75%     3.250000  32285.000000              1.0
max     4.000000  32990.000000              1.0

In [63]:
product_df['price'].groupby(product_df['SellerName']).mean()
product_df['price'].groupby(product_df['SellerName']).std()
product_df['price'].groupby(product_df['SellerName']).min()
product_df['price'].groupby(product_df['SellerName']).max()
product_df['price'].groupby(product_df['SellerName']).median()
product_df['price'].groupby(product_df['SellerName']).count()

SellerName
ABC Pvt    2
PQ Corp    1
XY Corp    1
Name: price, dtype: int64

In [68]:
product_df.corr()

                 ProductID     price  NumberOfProduct
ProductID         1.000000 -0.329618              NaN
price            -0.329618  1.000000              NaN
NumberOfProduct        NaN       NaN              NaN

In [70]:
product_df.sort_values(by='price')

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
1          2     Printer   5990            Delhi    ABC Pvt                1
3          4   Microwave  12670           Mumbai    PQ Corp                1
2          3    Split AC  32050             Pune    XY Corp                1
0          1       LEDTV  32990            Delhi    ABC Pvt                1

In [72]:
product_df.sort_values(by='price',ascending=False)

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1
1          2     Printer   5990            Delhi    ABC Pvt                1

In [74]:
product_df.sort_values(by=['SellerName','price'])

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
1          2     Printer   5990            Delhi    ABC Pvt                1
0          1       LEDTV  32990            Delhi    ABC Pvt                1
3          4   Microwave  12670           Mumbai    PQ Corp                1
2          3    Split AC  32050             Pune    XY Corp                1

In [76]:
product_df.dtypes

ProductID            int64
ProductName         object
price                int64
ShippingLocation    object
SellerName          object
NumberOfProduct      int64
dtype: object

In [78]:
product_df['price'].astype(str)

0    32990
1     5990
2    32050
3    12670
Name: price, dtype: object

In [82]:
#Declare lambda function
smallText =lambda x: x.lower()

#Apply on any column of dataframe
product_df['ShippingLocation'].apply(smallText)

0     delhi
1     delhi
2      pune
3    mumbai
Name: ShippingLocation, dtype: object

In [85]:
from sklearn import preprocessing
data = {'price':[492,286,487,519,541,429]}

price_frame = pandas.DataFrame(data)

min_max_normalizer = preprocessing.scale(price_frame)
price_frame_normalized = pandas.DataFrame(min_max_normalizer,columns=['price'])
price_frame_normalized

      price
0  0.389694
1 -2.042943
2  0.330650
3  0.708535
4  0.968331
5 -0.354268